%%创建9个网页互相指向的超链接矩阵%%
store = [0,0,1,0,2,2,0,3,1;
         0,0,0,0,0,0,3,0,0;
         2,0,0,0,3,1,0,1,0;
         0,1,0,0,0,0,4,0,0;
         1,0,1,0,0,1,0,1,0;
         1,0,2,0,1,0,0,1,0;
         1,2,0,1,1,0,0,0,0;
         1,0,1,0,0,0,0,6,0;
         0,0,0,0,0,0,0,0,0];
     
%%初始化重要度结果数组%%
result = zeros(1, 9);
%%超链接矩阵的初始化%%
H = zeros(9, 9);
%%第i个网页的总超链接数%%
link = zeros(1, 9);
%%初始化谷歌矩阵%%
G = zeros(9, 9);
%%选定谷歌系数a为0.85%%
a = 0.85;
%%设定全一矩阵%%
J = ones(9, 9);

%%求解重要度算法部分%%
%%首先得到超链接矩阵%%
for i=1:9
    for j=1:9
    if(store(i, j)>0)
        link(i) = link(i)+store(i, j);
    end
    end
end

for i=1:9
    for j=1:9
        if(store(j, i)>0)
            H(i, j) = H(i, j)+store(j, i)/link(j);
        end
    end
end

%%将超链接矩阵进行初步修正为随机矩阵%%
for i=1:9
    H(i, 9) = 1/9;
end

%%谷歌矩阵求解%%
G = a*H + J*((1-a)/9);
%%谷歌矩阵的特征值以及特征向量,V为特征向量，C为对应的特征值%%
[V, C] = eig(G);

%%结果矩阵的输出%%
disp(store);
disp(H);
disp(G);
disp(V);
disp(C);